{"pageProps":{"frontMatter":{"title":"COVID19 and transition to remote working","date":"2020-05-26","description":"Insights and observations about the transition to remote work during the COVID-19 pandemic and its impact on team collaboration and productivity.","categories":["Remote Work","Team Leadership","Project Management","Work Culture"],"image":"/images/COVID19_and_transition_to_remote_working/covid19-Image1.jpg","original_link":"https://www.linkedin.com/pulse/covid19-transition-remote-working-fatih-y%C4%B1lmaz","readingTime":6},"content":"<p>It is obvious that COVID19 has affected our lives in many ways and without any doubt new effects of it will be observed in future. One of the significant changes is working from home. Remote working is not a new concept for tech companies but during this period we have seen that some other companies which run business in architectural design, publishing and even construction also tried working from home. Now many people ask that question: Why not after COVID19? It is a really good question and response from employers might bring new opportunities in the long term. Completely working from home is also quite new concept for me and I would like to share my observations and thoughts about it.</p>\n<p>Let's start with the positive ones.</p>\n<h2>Commute time and quality</h2>\n<p>Job opportunities are generally located in crowded and expensive cities like London, New York, San Francisco, Istanbul and Berlin. Although some of them have well established public transportation, commuting from home to work is always a problem for employees and they have to figure it out. There are many variables need to be taken into account such as distance between home and work, rent, public transportation quality &#x26; alternatives, commute time and transportation expenses. People who can go to work by bicycle are lucky ones 😊</p>\n<p><img src=\"/images/COVID19_and_transition_to_remote_working/covid19-Image1.jpg\" alt=\"Commute Time and Quality\"></p>\n<p>The INRIX global traffic scorecard shows that a Londoner lost 149 hours in congestion during 2019. (INRIX, 2020). Exposure to traffic congestion can be understood as being stressful in terms of the concept of impedance – the blocking or thwarting of movement and goal attainment (Novaco &#x26; Gonzalez, 2009). I live in Istanbul and I can say that one of the common complaint of employees in Istanbul is stress about traffic jam. It is clear that remote work will decrease average commuting time of employees and will give them more time for themselves. We have experienced it in the last 3 months and it is really great know that when you finish your work, you are at home. Less excuses for not working out and reading books 😊</p>\n<h2>Less interruption and distraction</h2>\n<p>Most of us experienced more efficient working during in the early morning or after everybody left the office. In the open offices there might be some distractions or interruptions which affect you in a negative way. Brigid Schulte published an article in Washington Post and she says \"Research has found that, in the financial services industry, interruptions can take up to 238 minutes a day. Then you have to restart. That's the loss of another 84 minutes. That leads to inefficiencies like momentum loss, do-overs because of errors. Stress and fatigue cost another 50 minutes.\" (Schulte, 2015). There are many different reasons for distractions and interruptions. What I want to highlight is office noise and open office problems. From time to time I am distracted by office noise and I also know that I also cause some distraction in the office because of my calls regarding work. I have experienced less interruption and distraction during home office days. I also heard positive thoughts from my colleagues and friends about it. It seems like getting into zone might be easier with remote working. I know that for families with little children, there might be other challenges but I believe it might be handled by flexible working hours and shared care for children. It is better to learn from experiences of families who has little children.</p>\n<h2>More mobility</h2>\n<p>Remote work might enable new options for all of us regarding mobility. During COVID19, many companies experienced remote working and it seems like some of them have more courage to try new things. Facebook CEO Mark Zuckerberg says that he expects 50% of the company's employees to work from home over the next five to 10 years. It sounds like a new era has already started for all of us. It means that you can live in Thailand and work for Facebook. It is a dream for most people who wants to live in another place but can't because they have to go to office.</p>\n<p><img src=\"/images/COVID19_and_transition_to_remote_working/covid19-Image2.jpg\" alt=\"Less Interruption and Distraction\"></p>\n<h2>What about negative effects?</h2>\n<h3>No social communication</h3>\n<p>What we certainly know about humankind is that social communication is really significant to create a community. Yuval Noah Harari clearly explained in his book \"Sapiens: A Brief History of Humankind\" how homo sapiens became the most intelligent creature on the world. Social interactions play a huge role in it. Social communication is also important to create team culture and establishing connections between team members. Mantle &#x26; Lichty highlight the importance of social communication in their book \"Managing the Unmanageable\" and they say \"Informal conversations that occur while wandering the hallways or running into each other over snacks result in increased team awareness, knowledge and sharing that we tend to take for granted.\" (2019).</p>\n<p><img src=\"/images/COVID19_and_transition_to_remote_working/covid19-Image3.jpg\" alt=\"More Mobility\"></p>\n<p>I think that social communication is not just good for sharing technical information but also learning about your teammate's life more and understand her/him better as a human. It will definitely help to create a trust within the team. Maybe it was not a good day for your colleague and you had a conversation about it. Now you know that your colleague may not be in her/his mood and it is good to know that information for a better communication. In a remote work environment, it would be much harder to get that kind of relationship between team members. Especially during the team build up phase, from my point of view communication of team should be one of the most important values that needs to be observed and improved. Team leaders should learn more about communication of remote teams and should be sure about that a healthy communication is established also in remote working environment.</p>\n<h3>Hard to flourish team culture</h3>\n<p>Processes and rules can be defined and followed in remote working environment but it is really hard to flourish team culture. We are not just robots trying to complete some work. We are human beings. Our personality strictly effects how we work. It is very challenging to compansate this in remote case. I can see that amount of love for working remote highly depends on personal conditions. Not every position even in software world has equal flexibility for remote working. So managers should take this into account to ensure equity within the team.</p>\n<hr>\n<h2>References</h2>\n<ol>\n<li><a href=\"https://inrix.com/scorecard/\">2019 Global Traffic Scorecard, INRIX</a></li>\n<li>Novaco &#x26; Gonzalez, (2009, January). Commuting and Well-being. <a href=\"https://www.researchgate.net/publication/251358676\">ResearchGate</a></li>\n<li>Schulte, (2015, June), Work interruptions can cost you 6 hours a day. An efficiency expert explains how to avoid them. <a href=\"https://www.washingtonpost.com/news/inspired-life/wp/2015/06/01/interruptions-at-work-can-cost-you-up-to-6-hours-a-day-heres-how-to-avoid-them/\">Washington Post</a></li>\n<li>Harari, (2015, February), Sapiens: A Brief History of Humankind</li>\n<li>Mantle &#x26; Lichty, (2019, November), Managing the Unmanageable: Rules, Tools, and Insights for Managing Software People and Teams</li>\n</ol>\n<hr>\n<p><em>This article was originally published on <a href=\"https://www.linkedin.com/pulse/covid19-transition-remote-working-fatih-y%C4%B1lmaz\">LinkedIn</a>.</em></p>\n"},"__N_SSG":true}