{"pageProps":{"frontMatter":{"title":"Rowing and team work","date":"2020-06-28","description":"Lessons learned from rowing about teamwork, synchronization, and harmony in software development teams.","categories":["Team Leadership","Software Development","Agile"],"image":"/images/Rowing_and_team_work/rowing-image1.png","original_link":"https://www.linkedin.com/pulse/rowing-team-work-fatih-y%C4%B1lmaz","readingTime":8},"content":"<p>Istanbul is definitely a chaotic city and sometimes it might be really hard to live but there are still many great things to do such as rowing in golden horn. In 2019, me and my wife decided to take a rowing course to do some work out and have some fun. We were absolutely beginners and had no idea what to do on boat. After first lesson I am astonished by how much team work is needed for rowing. It is not a surprise that team sports always demand certain level of team work but in the rowing I felt that you have to completely rely on your team mates.</p>\n<p>My experience in rowing showed me that there are really great lessons regarding being successful together. Firstly, let’s check shortly what rowing is to understand analogy better.</p>\n<p><img src=\"/images/Rowing_and_team_work/rowing-image1.png\" alt=\"Rowing\"></p>\n<h2>Rowing</h2>\n<p>Rowing is one of the oldest Olympic sports. It is known that rowing was first used in ancient Egypt, Greece and Rome for transportation. It is probably started as a sport in England in the 17th and early 18th centuries, with the Oxford-Cambridge university boat race in 1828. There are two types of rowing races which are sculling and sweep oar. Sculling events use two oars, whilst in sweep the rower holds one (Olympic.org).</p>\n<p>Athletes sit boat looking toward stern. They use oars to move bow direction. A full stroke is described in Wikipedia as “The rowing stroke may be characterized by three fundamental reference points. The catch, which is placement of the oar blade in the water, the drive, which is the part of the stoke where one pulls one on the oar, and the extraction, also known as the finish or release, when the rower removes the oar blade from the water. The action between catch and release is the first phase of the stroke that propels the boat.”</p>\n<p><img src=\"/images/Rowing_and_team_work/rowing-image2.png\" alt=\"Boat\"></p>\n<p>Before the first lesson we read theoretical information and thought that it wouldn’t be too hard on the boat. We know each other for years and we were going to figure out to move together but we could not. Definitely it was really difficult physically but it turned out to that the first biggest problem was our harmony.</p>\n<p><img src=\"/images/Rowing_and_team_work/rowing-image3.png\" alt=\"RowingDay\"></p>\n<h2>Harmony</h2>\n<p>Our rowing instructor was showing all details of the right rowing techniques. When we try to apply these techniques individually everything was ok but whenever we start rowing together our oars were hitting each other and believe me it is frustrating. I am physically more powerful than my wife so I was so impatient to finish my stroke and start the new one. This mentality on the boat was creating many problems. It can be easily seen that boat was not flowing lightly. Instead, we had to stop many times due to hitting oars and our acceleration was never good. After a few lessons it was obvious that we have to synchronize our strokes to move faster and flawless. At first our instructor helped us to find our rhythm with a sound as “oop” to let us know it is time to catch. Then we get to know each other better on the boat and this harmony becomes better and better.</p>\n<p>From my point of view there are very significant similarities between our problems on the boat and some problems of the teams. Let’s focus on a software development team. All team members have responsibilities on different areas such as development, design, requirement elicitation and testing. Just imagine that development, design, requirements and testing are people who row a boat. In that case if design tries to row faster than others it would definitely end up with problems. Without knowing more about requirements design of the software would probably will go to wrong direction. May be security of the product was the most important quality goals and you didn’t take into account so it is clear that your product will be in a position that does not fulfill customer needs. If development tries to go faster than others again it would cause some troubles. Without having right requirements, proper design and testing, you will have wrong product with poor quality.</p>\n<p>Same dynamics also fit for different departments of a company. Patrick Lencioni explains five dysfunctions of a team in a story form based on an imaginary company. In this story, although there were many brilliant talents in different departments of the company, they were in trouble. The main problem was misalignment of the goals of people from different units. They never worked as a team. Lencioni then explain the root causes of this disharmony in his book and explain what needs to be done to be a good team (Lencioni, 2002).</p>\n<p>Just imagine a software company with departments such as marketing, sales, product management and R&#x26;D. Think of these departments as team members of a rowing team. If R&#x26;D team does not pay enough attention to product management and sales inputs then probably product will be liked by only its developers not by the market. We know that if you can’t sell your software then you will not have enough money to do any R&#x26;D and even whole company will have hard days. On contrary if product management &#x26; sales try to row faster than R&#x26;D, they might get product which does not make anybody happy with its faults and low quality. R&#x26;D’s suggestions and ideas regarding technical constraints of a requirement should be taken into account by product management and sales.</p>\n<p>Goal alignment is one of the most significant challenges for companies. Regarding cross-functional coordination John Doer says that “For innovation and advanced problem solving, isolated individuals cannot match a connected group. Product relies on engineering, marketing on sales.” and then he continues as “Connected companies are quicker companies. To grab a competitive advantage, both leaders and contributors need to link up horizontally, breaking through barriers.” (Doerr, 2018). It is crystal clear that silo thinking is not going to be the way that we follow for complex challenges that we have.</p>\n<p>To be honest during our exercises from time to time I thought that instead of putting efforts for creating this harmony between me and my wife on the boat, I can row just myself for a while. I was even thinking that we might be better due to there will be no more hitting oars. What a mistake!</p>\n<h2>If you want to go fast, go alone. If you want to go far, go together</h2>\n<p>It is an African proverb and completely explains my misjudgment on the boat. After my wife just stopped to row for a while at first, I was feeling really great. I just focused on what I was doing and trying to concentrate on my technique. I didn’t have to pay attention what she was doing. Then after a few minutes I started to feel exhausted. Our boat was not for one person and there were three people on the boat. I definitely couldn’t maintain my rhythm and asked her to help me😊 Last but not the least regarding harmony, I think that we shouldn’t also miss that if one of the team members is rowing very slowly and not even trying her/his best then whole team directly affected by this in a negative way.</p>\n<p><img src=\"/images/Rowing_and_team_work/rowing-image4.png\" alt=\"RowingTeam\"></p>\n<h2>Joy of achieving together</h2>\n<p>During last lessons, we learned more about rowing techniques and became much better on the boat. We were catching the water, driving and releasing oars simultaneously. What I can say about that moment is pure joy of being in the flow. We were pushing really hard, it was a really tough workout but we were enjoying what we were doing and we were going much more faster. As DeMarco mentioned in his book “What’s in the foreground of most of our prized work memories is team interaction. When a group of people fuse into a meaningful whole, the entire character of the work changes. The challenge of the work is important, but not in and of itself; it is important because it gives us something to focus on together. The challenge is the instrument for our coming together. In the best work groups, the ones in which people have the most fun and perform at their upper limits, team interactions are everything. They are the reason that people stick it out, put their all into the work, overcome enormous obstacles.” (DeMarco &#x26; Lister, 2013).</p>\n<p>Eventually, with my short period of rowing experience one more time I learned that If you want to go fast, go alone. If you want to go far, go together.</p>\n<hr>\n<h2>References</h2>\n<ol>\n<li>https://www.olympic.org/rowing</li>\n<li>https://www.pexels.com/</li>\n<li>https://pixabay.com/</li>\n<li>https://en.wikipedia.org/wiki/Rowing_(sport)</li>\n<li>Patrick M.Lencioni, 2002, The Five Dysfunctions of a Team: A Leadership Fable.</li>\n<li>John Doerr, 2018, Measure What Matters</li>\n<li>Tim Lister &#x26; Tom DeMarco, 2013, Peopleware: Productive Projects and Teams, Third Edition.</li>\n</ol>\n<hr>\n<p><em>This article was originally published on <a href=\"https://www.linkedin.com/pulse/rowing-team-work-fatih-y%C4%B1lmaz\">LinkedIn</a>.</em></p>\n"},"__N_SSG":true}